{
  "products": [
    {
      "id": 1,
      "name": "PlayStation 2 USB Modded Console",
      "brand": "Sony",
      "category": "consoles",
      "price": 6500,
      "originalPrice": 8500,
      "discount": 2000,
      "stock": true,
       "images": [
        "images/console/ps2/ae-ps2-slim-1.jpg",
        "images/console/ps2/ae-ps2-slim-2.png",
        "images/console/ps2/ae-ps2-slim-3.png",
        "images/console/ps2/ae-ps2-slim-4.png"      
      ],
      "description": "The PlayStation® 2 generation included giant steps forward in home console gaming, with augmented reality, online multiplayer gaming, and more ambitious, large-scale games on DVD discs. Offering users cutting-edge gaming, DVD playback, online functionality, and backward compatibility with original PlayStation discs, the PS2 console represented an irresistible package at launch and throughout its lifespan. The PS2 library is one of the most diverse and expansive in gaming history, with thousands of titles spanning every genre imaginable, from iconic franchises to hidden gems. The console's longevity and continued popularity among gamers worldwide are a testament to its enduring appeal and the unforgettable experiences it provided.",
      "specs": ["PlayStation 2 Console", "Model 70xxx / 90xxx","USB Modded", "Includes 2 Controllers", "64GB Pendrive with Games", "Memory Card Included","power and AV Cables"],
      "availability": "In Stock"
    },
    {
      "id": 2,
      "name": "Sony PlayStation 3 Slim Jailbroken 500gb Hard-Drive ( Refurbuished Model)",
      "brand": "Sony",
      "category": "consoles",
      "price": 14500,
      "originalPrice": 15500,
      "discount": 1000,
      "stock": true,
      "images": [
        "images/console/ps3/ae-ps3-slim-1.png",
        "images/console/ps3/ae-ps3-slim-2.png",
        "images/console/ps3/ae-ps3-slim-3.png"        
      ],
      "description": "The PlayStation® 3 era built on the legacy of previous generations with incredible leaps forward in online gaming and digital services, while the arrival of Blu-ray Disc games allowed creators to expand their ambitions and build truly immersive game worlds on a grand scale. The PS3 console delivered cutting-edge graphics, a robust online ecosystem, and multimedia capabilities that transformed the living room experience. As well as introducing gamers to incredible single-player adventures and revolutionary online experiences, PS3™ became an entertainment mainstay in owners’ homes thanks to new music and movie streaming apps, and easily accessible digital games via the new PlayStation™ Store. The PS3 library is known for its diverse range of titles, including exclusive franchises and innovative gameplay experiences that pushed the boundaries of gaming technology.",
      "specs": ["PlayStation 3 Console", "Model: Slim /Super-SLim", "500GB HDD Storage", "2 Wireless Controllers", "1 Power Cable", "1 HDMI Cable","1 USB Cable","25-30 Games Preloaded","Games as per user choice"],
      "availability": "In Stock"
    },
    {
      "id": 3,
      "name": "AE 14 Pin Power Flex Cable for Sony PS4 Playstation 4 Controller",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 180,
      "originalPrice": 300,
      "discount": 120,
      "stock": true,
      "images": ["images/parts/ps4/ae-14pin-flex-1.jpg","images/parts/ps4/ae-14pin-flex-2.jpg","images/parts/ps4/ae-14pin-flex-3.jpg"],
      "description": "High-quality 14-pin power flex cable replacement for Sony PS4 DualShock 4 controllers. Essential repair part for fixing charging issues, power connection problems, and controller functionality. This AE-TECH power flex cable ensures reliable power transmission and stable charging performance. Compatible with PlayStation 4 controllers, easy to install with basic soldering skills.",
      "specs": ["14-Pin Power Connector", "Compatible with PS4 Controllers", "Fixes Charging Issues", "High-Quality Flex Cable", "Professional Repair Part"],
      "availability": "In Stock"
    },
    {
      "id": 4,
      "name": "AE 12 Pin Power Flex Cable for Sony PS4 Playstation 4 Controller",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 180,
      "originalPrice": 300,
      "discount": 120,
      "stock": true,
      "images": ["images/parts/ps4/ae-12pin-flex-1.jpg","images/parts/ps4/ae-12pin-flex-2.jpg","images/parts/ps4/ae-12pin-flex-3.jpg"],
      "description": "High-quality 12-pin power flex cable replacement for Sony PS4 DualShock 4 controllers. Essential repair part for fixing charging issues, power connection problems, and controller functionality. This AE-TECH power flex cable ensures reliable power transmission and stable charging performance. Compatible with PlayStation 4 controllers, easy to install with basic soldering skills.",
      "specs": ["12-Pin Power Connector", "Compatible with PS4 Controllers", "Fixes Charging Issues", "High-Quality Flex Cable", "Professional Repair Part"],
      "availability": "In Stock"
    },
    {
      "id": 5,
      "name": "AE Replacement Button Ribbon Cable Sheet for PlayStation 4 PS4 Wireless Controller JDM-040",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 249,
      "originalPrice": 350,
      "discount": 101,
      "stock": true,
      "images": ["images/parts/ps4/AE-PS4-V2-FLEX-1.jpg","images/parts/ps4/AE-PS4-V2-FLEX-2.jpg","images/parts/ps4/AE-PS4-V2-FLEX-3.jpg"],  
      "description": "High-quality replacement button ribbon cable sheet for PlayStation 4 wireless controller model JDM-040. This AE-TECH flex cable connects the controller buttons to the main board, ensuring proper functionality of all action buttons. Essential repair part for fixing unresponsive buttons, sticky controls, or button input failures on PS4 DualShock 4 controllers. Compatible with JDM-040 controller version, easy installation with proper disassembly.",
      "specs": ["Compatible with PS4 JDM-040 Controllers", "Button Ribbon Flex Cable", "Fixes Unresponsive Buttons", "High-Quality Replacement Part", "Professional Repair Component"],
      "availability": "In Stock"
    },
    {
      "id": 6,
      "name": "AE Silicone Rubber Conductive Button Pad Set for PS4 DualShock 4 Controller JDS-050 JDS-055",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 199,
      "originalPrice": 350,
      "discount": 151,
      "stock": true,
      "images": ["images/parts/ps4/AE-PS4-SRS-V2-1.jpg","images/parts/ps4/AE-PS4-SRS-V2-2.jpg","images/parts/ps4/AE-PS4-SRS-V2-3.jpg"],
      "description": "High-quality silicone rubber conductive button pad set for PlayStation 4 DualShock 4 controllers model JDS-050 and JDS-055. This AE-TECH replacement kit includes the D-Pad, conductive film, and buttons, providing soft, durable, and high sensitivity repair components. Essential for fixing unresponsive or sticky buttons, restoring controller functionality. Compatible with JDS-050 and JDS-055 controller versions, easy installation with proper disassembly.",
      "specs": ["Compatible with PS4 JDS-050 and JDS-055 Controllers", "Silicone Rubber Conductive Pads", "Includes D-Pad and Buttons", "Soft and Durable Material", "High Sensitivity Repair Kit"],
      "availability": "In Stock"
    },
    {
      "id": 7,
      "name": "AE Replacement Analog Joystick Cap for PS4 PlayStation 4 Wireless Controller Remote V1",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 249,
      "originalPrice": 350,
      "discount": 101,
      "stock": true,
      "images": ["images/parts/ps4/AE-PS4-ANALOGCAPS-1.jpg","images/parts/ps4/ae-ps4-analogcaps-2.jpg","images/parts/ps4/AE-PS4-ANALOGCAPS-3.jpg"],
      "description": "Premium replacement analog joystick caps for PlayStation 4 DualShock 4 wireless controller V1 models. These AE-TECH analog caps restore worn or damaged thumbsticks to factory-fresh condition. Featuring enhanced grip texture and durable construction, these caps provide superior control during intense gaming sessions. Perfect replacement for controllers with drift issues, worn rubber, or loose analog sticks. Easy DIY installation compatible with PS4 V1 controller models.",
      "specs": ["Compatible with PS4 DualShock 4 V1", "Analog Thumbstick Caps", "Enhanced Grip Texture", "Durable Construction", "Easy Installation"],
      "availability": "In Stock"
    },
    {
      "id": 8,
      "name": "AE Replacement Analog Joystick Cap for PS4 PlayStation 4 Wireless Controller Remote V2",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 249,
      "originalPrice": 350,
      "discount": 101,
      "stock": true,
      "images": ["images/parts/ps4/AE-PS4-ANALOGCAPS-V2-1.jpg","images/parts/ps4/ae-ps4-analogcaps-V2-2.jpg","images/parts/ps4/AE-PS4-ANALOGCAPS-V2-3.jpg"],
      "description": "Premium replacement analog joystick caps for PlayStation 4 DualShock 4 wireless controller V2 models. These AE-TECH analog caps restore worn or damaged thumbsticks to factory-fresh condition. Featuring enhanced grip texture and durable construction, these caps provide superior control during intense gaming sessions. Perfect replacement for controllers with drift issues, worn rubber, or loose analog sticks. Easy DIY installation compatible with PS4 V2 controller models.",
      "specs": ["Compatible with PS4 DualShock 4 V2", "Analog Thumbstick Caps", "Enhanced Grip Texture", "Durable Construction", "Easy Installation"],
      "availability": "In Stock"
    },

    {
      "id": 9,
     "name": "AE Replacement Analog Joystick Cap for PS5 PlayStation 5 Wireless Controller Remote",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 249,
      "originalPrice": 350,
      "discount": 101,
      "stock": true,
      "images": ["images/parts/ps5/AE-PS5-ANALOGCAPS-1.jpg","images/parts/ps5/ae-ps5-analogcaps-2.jpg","images/parts/ps5/AE-PS5-ANALOGCAPS-3.jpg"],
      "description": "Premium replacement analog joystick caps for PlayStation 5 DualSense wireless controller models. These AE-TECH analog caps restore worn or damaged thumbsticks to factory-fresh condition. Featuring enhanced grip texture and durable construction, these caps provide superior control during intense gaming sessions. Perfect replacement for controllers with drift issues, worn rubber, or loose analog sticks. Easy DIY installation compatible with PS5 DualSense controller models.",
      "specs": ["Compatible with PS5 DualSense", "Analog Thumbstick Caps", "Enhanced Grip Texture", "Durable Construction", "Easy Installation"],
      "availability": "In Stock"
    },
    {
      "id": 10,
      "name": "AE Replacement PS5 Board Button Flex Cable for PS5 Wireless Controller - V2.0 BDM-020",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 350 ,
      "originalPrice": 650,
      "discount": 300,
      "stock": true,
      "images": ["images/parts/ps5/AE-PS5-FLEX-V2-1.jpg","images/parts/ps5/AE-PS5-FLEX-V2-2.jpg","images/parts/ps5/AE-PS5-FLEX-V2-3.jpg","images/parts/ps5/AE-PS5-FLEX-V2-4.jpg","images/parts/ps5/AE-PS5-FLEX-V2-5.jpg"],
      "description": "High-quality conductive film replacement board button flex cable for PlayStation 5 DualSense wireless controller V2.0 model BDM-020. This AE-TECH replacement part connects all controller buttons to the main circuit board, ensuring proper button response and functionality. Essential repair component for fixing unresponsive buttons, sticky controls, or button input failures on PS5 DualSense controllers. Compatible with PS5 controller model BDM-020, professional-grade replacement part for optimal performance.",
      "specs": ["Compatible with PS5 DualSense BDM-020", "Conductive Film Board", "Button Ribbon Flex Cable", "Fixes Unresponsive Buttons", "High-Quality Replacement Part"],
      "availability": "In Stock"
    },
    {
      "id": 11,
      "name": "AE Replacement PS5 Board Button Flex Cable for PS5 Wireless Controller - V3.0 BDM-030 & BDM-040",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 350,
      "originalPrice": 599,
      "discount": 249,
      "stock": true,
      "images": ["images/parts/ps5/AE-PS5-FLEX-V3-1.jpg","images/parts/ps5/AE-PS5-FLEX-V3-2.jpg","images/parts/ps5/AE-PS5-FLEX-V3-3.jpg","images/parts/ps5/AE-PS5-FLEX-V3-4.jpg","images/parts/ps5/AE-PS5-FLEX-V3-5.jpg"],
      "description": "Premium button ribbon flex cable for PlayStation 5 DualSense V3.0 and V4.0 controllers (BDM-030 and BDM-040). This AE-TECH conductive film connects the face buttons, D-pad, and function buttons to the controller PCB to restore precise inputs. Ideal for fixing unresponsive buttons, erratic inputs, or damaged flex film on DualSense pads. Built for reliable conductivity and fits the BDM-030 and BDM-040 board layouts for a clean repair.",
      "specs": ["Fits PS5 DualSense BDM-030 & BDM-040", "Button Ribbon / Conductive Film", "Restores Face and D-Pad Inputs", "Reliable Conductivity for Repairs", "Model-Specific PCB Alignment"],
      "availability": "In Stock"
    },
    {
      "id": 12,
      "name": "AE Replacement PS5 Board Button Flex Cable for PS5 Wireless Controller - V1.0 BDM-010",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 350,
      "originalPrice": 599,
      "discount": 249,
      "stock": true,
      "images": ["images/parts/ps5/AE-PS5-FLEX-V1-1.jpg","images/parts/ps5/AE-PS5-FLEX-V1-2.jpg","images/parts/ps5/AE-PS5-FLEX-V1-3.jpg","images/parts/ps5/AE-PS5-FLEX-V1-4.jpg","images/parts/ps5/AE-PS5-FLEX-V1-5.jpg"],
      "description": "OEM-style button ribbon flex cable (conductive film) for PlayStation 5 DualSense controller V1.0 BDM-010. This flex connects the face buttons, D-pad, and function buttons to the controller PCB, restoring precise input response. Ideal for repairing unresponsive buttons, intermittent inputs, or damaged flex film on early PS5 controllers. Built for reliable conductivity and fits the BDM-010 board layout.",
      "specs": ["Fits PS5 DualSense BDM-010", "Button Ribbon Conductive Film", "Restores Face and D-Pad Inputs", "Reliable Signal Conductivity", "Model-Specific Alignment"],
      "availability": "In Stock"
    },
    {
      "id": 13,
       "name": "AE 8MB Memory Card for Sony PlayStation 2 (PS2) Console – High-Speed Game Save Card for PS2 Fat & Slim Models",
      "brand": "AE-TECH",
      "category": "accessories",
      "price": 400,
      "originalPrice": 499,
      "discount": 99,
      "stock": true,
       "images": [
        "images/accessories/ps2/ps2mc1.jpg",
        "images/accessories/ps2/ps2mc2.jpg",
        "images/accessories/ps2/ps2mc3.jpg",
        "images/accessories/ps2/ps2mc4.jpg"             
      ],
      "description": "This memory card is exclusively for PS-2 and gives real 8MB memory on a single card. Used for archiving the game process, to save the game progress 100% compatible with the memory card. This card is compatible for all version of the Sony PS2. Can works with both the standard PS2 and PS2 Slim version., this is the generic third party manufacture card not original Sony Manufacture Easy to use, just plug in and play. Packing Includes: 1 x Memory Card",
      "specs": ["This memory card is exclusively for PS2 and gives real 8MB memory on a single card.", "Used for archiving the game process, to save the game progress 100% compatible with the memory card.", "This card is compatible for all version of the Sony PS2. Can works with both the standard PS2 and PS2 Slim version.", "Easy to use, just plug in and play.", "Packing Includes: 1 x Memory Card"],
      "availability": "In Stock"
    },
    {
      "id": 14,
       "name": "AE PS2 & PS3 AV CVBS to 3RCA Cable For Sony Ps2 & Ps3 Console – Composite AV Cable",
      "brand": "AE-TECH",
      "category": "accessories",
      "price": 350,
      "originalPrice": 500,
      "discount": 150,
      "stock": true,
       "images": [
        "images/accessories/ps2/ps2av 1.jpg",
        "images/accessories/ps2/ps2av 2.jpg",
        "images/accessories/ps2/ps2av 3.jpg"              
      ],
      "description": "This AE-TECH Play Station AV CABLE PS AV Cable is made with high quality materials to ensure durability and video quality are met. This AV cable is compatible with multiple PlayStation models, including PS1, PS2, PS2 slim, PS3, and PS3 slim. Simply plug this AV cable into your Play Station and then into your TV’s corresponding inputs. Outputs at standard resolution. Ultra thick and flexible jacket with color coded connectors to simplify installation.",
      "specs": ["Compatible with PS1, PS2, PS2 slim, PS3, and PS3 slim.", "High-quality materials for durability and video quality.", "Color-coded connectors for easy installation.", "Outputs at standard resolution.", "Ultra thick and flexible jacket."],
      "availability": "In Stock"
    },
    {
      "id": 15,
      "name": "AE PS2 to HDMI Converter Adapter with 3.5mm Audio Output, High-Definition PS2 HDMI Cable Compatible with All ps2 Models",
      "brand": "AE-TECH",
      "category": "accessories",
      "price": 375,
      "originalPrice": 500,
      "discount": 125,
      "stock": true,
       "images": [
        "images/accessories/ps2/av2hdmi 1.jpg",
        "images/accessories/ps2/av2hdmi 2.jpg",
 	      "images/accessories/ps2/av2hdmi 3.jpg",
      	"images/accessories/ps2/av2hdmi 4.jpg"              
      ],
      "description": "This AE-TECH PS2 to HDMI Converter Adapter allows you to connect your PlayStation 2 console to modern HDTVs and monitors via HDMI. It supports all PS2 display modes (NTSC 480i/480p, PAL 576i) and provides high-definition video output without any loss in quality. The adapter also features a 3.5mm audio output for connecting headphones or external speakers, ensuring an immersive gaming experience. Easy to set up and use, this converter is compatible with all PS2 models, making it a versatile accessory for retro gaming enthusiasts.",
      "specs":["Supports all PS2 display modes (NTSC 480i/480p, PAL 576i)", "High-definition HDMI video output", "3.5mm audio output for headphones or external speakers", "Easy plug-and-play setup", "Compatible with all PS2 models"],
      "availability": "In Stock"
    },


    {
      "id": 16,
      "name": "AE PS5 Replacement Silicone Rubber Pad Button Pads for PS5 PlayStation 5 Controller",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 299,
      "originalPrice": 499,
      "discount": 200,
      "stock": true,
      "images": ["images/parts/ps5/AE-PS5-SRS-1.jpg","images/parts/ps5/AE-PS5-SRS-2.jpg","images/parts/ps5/AE-PS5-SRS-3.jpg","images/parts/ps5/AE-PS5-SRS-4.jpg","images/parts/ps5/AE-PS5-SRS-5.jpg"],
      "description": "High-quality silicone rubber conductive button pad set for PlayStation 5 DualSense controllers. This AE-TECH replacement kit includes the D-Pad, conductive film, and buttons, providing soft, durable, and high sensitivity repair components. Essential for fixing unresponsive or sticky buttons, restoring controller functionality. Compatible with PS5 DualSense controller models, easy installation with proper disassembly.",
      "specs": ["Compatible with PS5 DualSense Controllers", "Silicone Rubber Conductive Pads", "Includes D-Pad and Buttons", "Soft and Durable Material", "High Sensitivity Repair Kit"],
      "availability": "In Stock"
    },
    {
      "id": 17,
      "name": "AE R2-L2 L1-R1 Replacement Cable Ribbon Strip for Playstation 5 Controller Trigger Button (Left and Right Button)",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 450,
      "originalPrice": 750,
      "discount": 300,
      "stock": true,
      "images": ["images/parts/ps5/AE-L1L2R1R2-V1-FLEX-1.jpg","images/parts/ps5/AE-L1L2R1R2-V1-FLEX-2.jpg","images/parts/ps5/AE-L1L2R1R2-V1-FLEX-3.jpg","images/parts/ps5/AE-L1L2R1R2-V1-FLEX-4.jpg"],
      "description": "High-quality replacement ribbon cable strip for PlayStation 5 DualSense controller trigger buttons (L1, L2, R1, R2). This AE-TECH flex cable connects the trigger buttons to the main circuit board, ensuring proper button response and functionality. Essential repair component for fixing unresponsive triggers, sticky controls, or button input failures on PS5 DualSense controllers. Compatible with PS5 DualSense controller models, professional-grade replacement part for optimal performance.",
      "specs": ["Compatible with PS5 DualSense Controllers", "Ribbon Cable Strip for L1, L2, R1, R2 Buttons", "Fixes Unresponsive Trigger Buttons", "High-Quality Replacement Part", "Professional Repair Component"],
      "availability": "In Stock"
    },
    {
      "id": 18,
      "name": "AE R2-L2 L1-R1 Replacement Cable Ribbon Strip for Playstation 5 Controller Trigger Button V3.0 & V4.0 BDM-030 & BDM-040",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 450 ,
      "originalPrice": 750,
      "discount": 300,
      "stock": true,
      "images": ["images/parts/ps5/AE-L1L2R1R2-V3-FLEX-1.jpg","images/parts/ps5/AE-L1L2R1R2-V3-FLEX-2.jpg","images/parts/ps5/AE-L1L2R1R2-V3-FLEX-3.jpg","images/parts/ps5/AE-L1L2R1R2-V3-FLEX-4.jpg","images/parts/ps5/AE-L1L2R1R2-V3-FLEX-5.jpg"],
      "description": "High-quality replacement ribbon cable strip for PlayStation 5 DualSense controller trigger buttons (L1, L2, R1, R2) for V3.0 and V4.0 models (BDM-030 & BDM-040). This AE-TECH flex cable connects the trigger buttons to the main circuit board, ensuring proper button response and functionality. Essential repair component for fixing unresponsive triggers, sticky controls, or button input failures on PS5 DualSense controllers. Compatible with PS5 DualSense controller models BDM-030 & BDM-040, professional-grade replacement part for optimal performance.",
      "specs": ["Compatible with PS5 DualSense BDM-030 & BDM-040", "Ribbon Cable Strip for L1, L2, R1, R2 Buttons", "Fixes Unresponsive Trigger Buttons", "High-Quality Replacement Part", "Professional Repair Component"],
      "availability": "In Stock"
    },
    {
      "id": 19,
      "name": "Sony PlayStation 3 Super-Slim Jailbroken 500gb Hard-Drive ( Refurbuished Model)",
      "brand": "Sony",
      "category": "consoles",
      "price": 14500,
      "originalPrice": 15500,
      "discount": 1000,
      "stock": true,
      "images": [
        "images/console/ps3/ae-ps3-superslim-1.png"],
      "description": "The PlayStation® 3 era built on the legacy of previous generations with incredible leaps forward in online gaming and digital services, while the arrival of Blu-ray Disc games allowed creators to expand their ambitions and build truly immersive game worlds on a grand scale. The PS3 console delivered cutting-edge graphics, a robust online ecosystem, and multimedia capabilities that transformed the living room experience. As well as introducing gamers to incredible single-player adventures and revolutionary online experiences, PS3™ became an entertainment mainstay in owners’ homes thanks to new music and movie streaming apps, and easily accessible digital games via the new PlayStation™ Store. The PS3 library is known for its diverse range of titles, including exclusive franchises and innovative gameplay experiences that pushed the boundaries of gaming technology.",
      "specs": ["PlayStation 3 Console", "Model: Slim /Super-SLim", "500GB HDD Storage", "2 Wireless Controllers", "1 Power Cable", "1 HDMI Cable","1 USB Cable","25-30 Games Preloaded","Games as per user choice"],
      "availability": "In Stock"
    },
    {
      "id": 20,
      "name": "AE DualShock-2 Controller for PlayStation 2 | Vibration Feedback, Analog Sticks, Wired|",
      "brand": "AE-TECH",
      "category": "accessories",
      "price": 350,
      "originalPrice": 500,
      "discount": 150,
      "stock": true,
      "images": [
        "images/accessories/ps2/ae-ps2-ds2.png"],
      "description": "The PlayStation® 2 DualShock controller offers precise control and immersive gameplay with its vibration feedback and analog sticks. Designed for comfort and durability, this wired controller is perfect for enhancing your gaming experience on the PlayStation 2 console.",
      "specs": ["Wired DualShock Controller", "Vibration Feedback", "Analog Sticks", "Compatible with PlayStation 2", "Black Color"],
      "availableColors": ["Black", "White", "Red", "Blue"],
      "availability": "In Stock"
    },
    {
      "id": 21,
      "name": "AE DualShock-3 Controller for PlayStation 3 | Vibration, Analog Sticks, Bluetooth |",
      "brand": "AE-TECH",
      "category": "accessories",
      "price": 900,
      "originalPrice": 1500,
      "discount": 600,
      "stock": true,
      "images": ["images/accessories/ps3/ae-ps3-ds3-2.jpg","images/accessories/ps3/ae-ps3-ds3-1.jpg","images/accessories/ps3/ae-ps3-ds3-3.jpg","images/accessories/ps3/ae-ps3-ds3-4.jpg"],
      "description": "The PlayStation® 3 DualShock controller offers precise control and immersive gameplay with its vibration feedback and analog sticks. Designed for comfort and durability, this wired controller is perfect for enhancing your gaming experience on the PlayStation 3 console.",
      "specs": ["Wireless DualShock-3 Controller", "Vibration Feedback", "Analog Sticks", "Compatible with PlayStation 3", "Black Color"],
      "availableColors": ["Black", "White", "Silver", "Midnight Blue"],
      "availability": "In Stock"
    },
    {
      "id": 22,
      "name": "AE DualShock-4 Controller for PlayStation 4 | Vibration, Analog Sticks, Bluetooth |",
      "brand": "AE-TECH",
      "category": "accessories",
      "price": 1500,
      "originalPrice": 2500,
      "discount": 1000,
      "stock": true,
      "images": ["images/accessories/ps4/ae-ps4-ds4-1.jpg","images/accessories/ps4/ae-ps4-ds4-2.jpg","images/accessories/ps4/ae-ps4-ds4-1.png","images/accessories/ps4/ae-ps4-ds4-2.png"],
      "description": "The PlayStation® 4 DualShock controller offers precise control and immersive gameplay with its vibration feedback and analog sticks. Designed for comfort and durability, this wired controller is perfect for enhancing your gaming experience on the PlayStation 4 console.",
      "specs": ["Wireless DualShock-4 Controller", "Vibration Feedback", "Analog Sticks", "Compatible with PlayStation 4", "Available in Multiple Colors"],
      "colorVariants": [
        {
          "color": "Black",
          "images": ["images/accessories/ps4/ae-ps4-ds4-1.jpg","images/accessories/ps4/ae-ps4-ds4-2.jpg"]
        }
        
      ],
      "availability": "In Stock"
    },
    {
      "id": 23,
      "name": "AE 5 Pin Mini USB 2.0 Type A to Mini B Cable Compatible with PS3 Controller, MP3 Player, Digital Camera (Black)",
      "brand": "AE-TECH",
      "category": "accessories",
      "price": 299,
      "originalPrice": 450,
      "discount": 151,
      "stock": true,
      "images": ["images/accessories/ps3/ae-ps3-usb-cable-1.jpg","images/accessories/ps3/ae-ps3-usb-cable-2.jpg","images/accessories/ps3/ae-ps3-usb-cable-3.jpg","images/accessories/ps3/ae-ps3-usb-cable-4.jpg","images/accessories/ps3/ae-ps3-usb-cable-5.jpg"],
      "description": "This AE-TECH 5 Pin Mini USB 2.0 Type A to Mini B Cable is designed for connecting your PlayStation 3 controller, MP3 player, digital camera, and other compatible devices to your computer or charger. With a length of 1.5 meters, this cable provides flexibility and convenience for charging and data transfer. The durable construction ensures long-lasting performance, while the black color adds a sleek look to your accessories.",
      "specs": ["5 Pin Mini USB 2.0 Type A to Mini B Cable", "Length: 1.5 meters", "Compatible with PS3 Controller, MP3 Player, Digital Camera", "Durable Construction", "Black Color"],
      "availability": "In Stock"
    },
    {
      "id": 24,
      "name": "AE PS4 Controller Charger Cable, Micro USB Charging Cable for Sony Dualshock 4, Microsoft Xbox One Controller",
      "brand": "AE-TECH",
      "category": "accessories",
      "price": 299,
      "originalPrice": 450,
      "discount": 151,
      "stock": true,
      "images": ["images/accessories/ps4/ae-ps4-usb-cable-1.jpg","images/accessories/ps4/ae-ps4-usb-cable-2.jpg","images/accessories/ps4/ae-ps4-usb-cable-3.jpg","images/accessories/ps4/ae-ps4-usb-cable-4.jpg","images/accessories/ps4/ae-ps4-usb-cable-5.jpg"],
      "description": "This AE-TECH 1.8M Charger for PS4 Controller Charger Cable is designed for charging and syncing your Sony PS4/Dualshock 4/PS4 Slim/Pro and Microsoft Xbox One/One S/One X controllers. With a length of 1.8 meters (5.9 feet), this micro USB cable provides convenience and flexibility for your gaming setup. The durable construction ensures long-lasting performance, while the black color adds a sleek look to your accessories.",
      "specs": ["1.8M Charger Cable", "Length: 1.8 meters (5.9 feet)", "Compatible with Sony PS4/Dualshock 4/PS4 Slim/Pro and Microsoft Xbox One/One S/One X Controllers", "Durable Construction", "Black Color"],
      "availability": "In Stock"
    },
    {
      "id": 25,
      "name": "AE PS5 Controller Charger Cable, USB to Type-C Charging Cable for Sony DualSense Controller, Microsoft Xbox Series Controller",
      "brand": "AE-TECH",
      "category": "accessories",
      "price": 399,
      "originalPrice": 450,
      "discount": 51,
      "stock": true,
      "images": ["images/accessories/ps5/ae-ps5-usb2c-cable-1.jpg","images/accessories/ps5/ae-ps5-usb2c-cable-2.jpg","images/accessories/ps5/ae-ps5-usb2c-cable-3.jpg","images/accessories/ps5/ae-ps5-usb2c-cable-4.jpg","images/accessories/ps5/ae-ps5-usb2c-cable-5.jpg"],
      "description": "This AE-TECH 1.8M Charger for PS5 Controller Charger Cable is designed for charging and syncing your Sony PS5/DualSense and Microsoft Xbox Series controllers. With a length of 1.8 meters (5.9 feet), this USB to Type-C cable provides convenience and flexibility for your gaming setup. The durable construction ensures long-lasting performance, while the black color adds a sleek look to your accessories.",
      "specs": ["1.8M Charger Cable", "Length: 1.8 meters (5.9 feet)", "Compatible with Sony PS5/DualSense and Microsoft Xbox Series Controllers", "Durable Construction", "Black Color"],
      "availability": "In Stock"
    },
    {
      "id": 26,
      "name": "AE PS2 Cooling Fan Replacement Fan for PS2 Slim Console 90000 9000X Internal Cooling Fan",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 599,
      "originalPrice": 800,
      "discount": 201,
      "stock": true,
      "images": ["images/parts/ps2/ae-ps2-fan-90xxx-1.jpg","images/parts/ps2/ae-ps2-fan-90xxx-2.jpg","images/parts/ps2/ae-ps2-fan-90xxx-3.jpg","images/parts/ps2/ae-ps2-fan-90xxx-4.jpg","images/parts/ps2/ae-ps2-fan-90xxx-5.jpg"],
      "description": "This AE-TECH Internal Cooling Fan Replacement Fan is designed for PS2 Slim Console models 90000 and 9000X. It helps maintain optimal temperature by providing efficient cooling to prevent overheating during extended gaming sessions. The fan is easy to install and ensures your console runs smoothly and reliably.",
      "specs": ["Internal Cooling Fan", "Compatible with PS2 Slim Console 90000 and 9000X", "Efficient Cooling Performance", "Easy Installation", "Durable Construction"],
      "availability": "In Stock"
    },
    {
      "id": 27,
      "name": "AE PS2 Cooling Fan Replacement Fan for PS2 Slim Console 70000 7000X 7500X Internal Cooling Fan",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 599,
      "originalPrice": 800,
      "discount": 201,
      "stock": true,
      "images": ["images/parts/ps2/ae-ps2-fan-70xxx-1.jpg","images/parts/ps2/ae-ps2-fan-70xxx-2.jpg","images/parts/ps2/ae-ps2-fan-70xxx-3.jpg","images/parts/ps2/ae-ps2-fan-70xxx-4.jpg"],
      "description": "This AE-TECH Internal Cooling Fan Replacement Fan is designed for PS2 Slim Console models 70000, 7000X, and 7500X. It helps maintain optimal temperature by providing efficient cooling to prevent overheating during extended gaming sessions. The fan is easy to install and ensures your console runs smoothly and reliably.",
      "specs": ["Internal Cooling Fan", "Compatible with PS2 Slim Console 70000, 7000X, and 7500X", "Efficient Cooling Performance", "Easy Installation", "Durable Construction"],
      "availability": "In Stock"
    },
    {
      "id": 28,
      "name": "AE PS3 Slim Console Cooling Fan for PS3 Slim, 17 Blades Internal Cooling Fan Cooler Replacement for Playstation 3 Slim",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 1200,
      "originalPrice": 2100,
      "discount": 900,
      "stock": true,
      "images": ["images/parts/ps3/ae-ps3-fan-slim-1.jpg","images/parts/ps3/ae-ps3-fan-slim-2.jpg","images/parts/ps3/ae-ps3-fan-slim-3.jpg","images/parts/ps3/ae-ps3-fan-slim-4.jpg"],
      "description": "This AE-TECH Internal Cooling Fan Replacement Fan is designed for PS3 Slim Console models. It helps maintain optimal temperature by providing efficient cooling to prevent overheating during extended gaming sessions. The fan is easy to install and ensures your console runs smoothly and reliably.",
      "specs": ["Internal Cooling Fan", "Compatible with PS3 Slim Console", "Efficient Cooling Performance", "Easy Installation", "Durable Construction"],
      "availability": "In Stock"
    },
    {
      "id": 29,
      "name": "AE PS4 Fat Console Cooling Fan, 17 Blades Internal Cooling Fan Replacement for Playstation 4 Fat ( small pin )",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 1400,
      "originalPrice": 2000,
      "discount": 600,
      "stock": true,
      "images": ["images/parts/ps4/ae-ps4-fan-fat-smallpin-1.jpg","images/parts/ps4/ae-ps4-fan-fat-smallpin-2.jpg","images/parts/ps4/ae-ps4-fan-fat-smallpin-3.jpg","images/parts/ps4/ae-ps4-fan-fat-smallpin-4.jpg"],
      "description": "This AE-TECH Internal Cooling Fan Replacement Fan is designed for PS4 Fat Console models. It helps maintain optimal temperature by providing efficient cooling to prevent overheating during extended gaming sessions. The fan is easy to install and ensures your console runs smoothly and reliably.",
      "specs": ["Internal Cooling Fan", "Compatible with PS4 Fat Console", "Efficient Cooling Performance", "Easy Installation", "Durable Construction"],
      "availability": "In Stock"
    },
    {
      "id": 30,
      "name": "AE PS4 Slim Console Cooling Fan, Internal Cooling Fan Replacement for Playstation 4 Slim",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 1400,
      "originalPrice": 2000,
      "discount": 600,
      "stock": true,
      "images": ["images/parts/ps4/ae-ps4-fan-slim-1.jpg","images/parts/ps4/ae-ps4-fan-slim-2.jpg","images/parts/ps4/ae-ps4-fan-slim-3.jpg","images/parts/ps4/ae-ps4-fan-slim-4.jpg"],
      "description": "This AE-TECH Internal Cooling Fan Replacement Fan is designed for PS4 Slim Console models. It helps maintain optimal temperature by providing efficient cooling to prevent overheating during extended gaming sessions. The fan is easy to install and ensures your console runs smoothly and reliably.",
      "specs": ["Internal Cooling Fan", "Compatible with PS4 Slim Console", "Efficient Cooling Performance", "Easy Installation", "Durable Construction"],
      "availability": "In Stock"
    },
    {
      "id": 31,
      "name": "AE PS4 Pro Console Cooling Fan, Internal Cooling Fan Replacement for Playstation 4 Pro",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 1600,
      "originalPrice": 2000,
      "discount": 600,
      "stock": true,
      "images": ["images/parts/ps4/ae-ps4-fan-pro-4.jpg","images/parts/ps4/ae-ps4-fan-pro-2.jpg","images/parts/ps4/ae-ps4-fan-pro-3.jpg","images/parts/ps4/ae-ps4-fan-pro-1.jpg","images/parts/ps4/ae-ps4-fan-pro-5.jpg"],
      "description": "This AE-TECH Internal Cooling Fan Replacement Fan is designed for PS4 Pro Console models. It helps maintain optimal temperature by providing efficient cooling to prevent overheating during extended gaming sessions. The fan is easy to install and ensures your console runs smoothly and reliably.",
      "specs": ["Internal Cooling Fan", "Compatible with PS4 Pro Console", "Efficient Cooling Performance", "Easy Installation", "Durable Construction"],
      "availability": "In Stock"
    },
    {
      "id": 32,
      "name": "AE PS4 Internal Power Supply, ADP-240CR Built-in Replacement Power Supply,(4-pin)",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 6200,
      "originalPrice": 7000,
      "discount": 800,
      "stock": true,
      "images": ["images/parts/ps4/ae-ps4-240cr-1.jpg","images/parts/ps4/ae-ps4-240cr-2.jpg","images/parts/ps4/ae-ps4-240cr-3.jpg","images/parts/ps4/ae-ps4-240cr-4.jpg","images/parts/ps4/ae-ps4-240cr-5.jpg"],
      "description": "This AE-TECH Internal Power Supply Replacement is designed for PS4 Console models with ADP-240CR (4-pin) power supply. It provides reliable power to ensure your console operates smoothly and efficiently. The power supply is easy to install and is built to last, making it an essential component for maintaining your PS4's performance.",
      "specs": ["Internal Power Supply", "Compatible with PS4 Console ADP-240CR (4-pin)", "Reliable Power Delivery", "Easy Installation", "Durable Construction"],
      "availability": "In Stock"
    },
    {
      "id": 22,
      "name": "AE PS4 Controller USB Charging Port Charger Socket Board Replacement for Sony DualShock 4 Wireless Controller",
      "brand": "AE-TECH",
      "category": "parts",
      "price": 499,
      "originalPrice": 800,
      "discount": 301,
      "stock": true,
      "images": ["images/parts/ps4/ps4-usb-power-flex-1.jpg","images/parts/ps4/ps4-usb-power-flex-2.jpg","images/parts/ps4/ps4-usb-power-flex-3.jpg","images/parts/ps4/ps4-usb-power-flex-4.jpg"],
      "description": "High-quality replacement USB charging port socket board for PlayStation 4 DualShock 4 wireless controllers. This AE-TECH part restores proper charging functionality by replacing damaged or faulty USB ports. Essential for fixing issues like unresponsive charging, loose connections, or power delivery problems on PS4 controllers. Compatible with all DualShock 4 models, easy installation with proper disassembly.",
      "specs": ["Compatible with PS4 DualShock 4 Controllers", "USB Charging Port Socket Board", "Restores Charging Functionality", "Fixes Loose or Damaged Ports", "High-Quality Replacement Part"],
      "colorVariants": [
        {
          "color": "JDS-001",
          "images": ["images/parts/ps4/ps4-usb-power-flex-1.jpg","images/parts/ps4/ps4-usb-power-flex-1.jpg"]
        },
        {
          "color": "JDS-011",
          "images": ["images/parts/ps4/ps4-usb-power-flex-1.jpg","images/parts/ps4/ps4-usb-power-flex-1.jpg"]
        },
        {
          "color": "JDS-030",
          "images": ["images/parts/ps4/ps4-usb-power-flex-1.jpg","images/parts/ps4/ps4-usb-power-flex-1.jpg"]
        },
        {
          "color": "JDS-040",
          "images": ["images/parts/ps4/ps4-usb-power-flex-1.jpg","images/parts/ps4/ps4-usb-power-flex-1.jpg"]
        },
        {
          "color": "JDS-055",
          "images": ["images/parts/ps4/ps4-usb-power-flex-1.jpg","images/parts/ps4/ps4-usb-power-flex-1.jpg"]
        }
        
      ],
      "availability": "In Stock"
    }
  ]
}
